package gui;

import java.awt.Color;
import java.awt.Font;

import javax.swing.JFrame;
import javax.swing.JPanel;
import javax.swing.JScrollPane;
import javax.swing.JTextArea;

public class HelpFrame extends JFrame{
	
	private static final long serialVersionUID = -1876613774149568514L;
	
	private JScrollPane helpConsoleScrollPane;
    private JTextArea helpConsoleTextArea;
    private JPanel thePanel;
	
	public HelpFrame(MainFrame theMainFrame) {
		thePanel = new JPanel();
        helpConsoleScrollPane = new JScrollPane();
        helpConsoleTextArea = new JTextArea();

        helpConsoleTextArea.setBackground(new Color(0, 0, 0));
        helpConsoleTextArea.setColumns(20);
        helpConsoleTextArea.setFont(new Font("Courier New", 1, 24)); // NOI18N
        helpConsoleTextArea.setForeground(new Color(200, 200, 10));
        helpConsoleTextArea.setRows(5);
        helpConsoleScrollPane.setViewportView(helpConsoleTextArea);
        
        helpConsoleTextArea.setEditable(false);
        
        appendText(helpConsoleTextArea);

        javax.swing.GroupLayout thePanelLayout = new javax.swing.GroupLayout(thePanel);
        thePanel.setLayout(thePanelLayout);
        thePanelLayout.setHorizontalGroup(
            thePanelLayout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addComponent(helpConsoleScrollPane, javax.swing.GroupLayout.DEFAULT_SIZE, 9999, Short.MAX_VALUE)
        );
        thePanelLayout.setVerticalGroup(
            thePanelLayout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addComponent(helpConsoleScrollPane, javax.swing.GroupLayout.DEFAULT_SIZE, 9999, Short.MAX_VALUE)
        );

        javax.swing.GroupLayout layout = new javax.swing.GroupLayout(getContentPane());
        getContentPane().setLayout(layout);
        layout.setHorizontalGroup(
            layout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addComponent(thePanel, javax.swing.GroupLayout.DEFAULT_SIZE, javax.swing.GroupLayout.DEFAULT_SIZE, Short.MAX_VALUE)
        );
        layout.setVerticalGroup(
            layout.createParallelGroup(javax.swing.GroupLayout.Alignment.LEADING)
            .addComponent(thePanel, javax.swing.GroupLayout.DEFAULT_SIZE, javax.swing.GroupLayout.DEFAULT_SIZE, Short.MAX_VALUE)
        );

        
        this.setVisible(true);
        this.setTitle("Pylon-to-ERP - Βοήθεια");
        //this.setExtendedState(JFrame.MAXIMIZED_BOTH);
        this.setPreferredSize(new java.awt.Dimension(900, 600));
        this.setMaximumSize(new java.awt.Dimension(900, 600));
        this.setMinimumSize(new java.awt.Dimension(900, 600));
        this.setLocationRelativeTo(null);
        
        this.pack();
	}

	private void appendText(JTextArea helpConsoleTextArea) {
		helpConsoleTextArea.append("####################################################################################################\r\n"
				+ "########################################  PYLON-TO-ERP  ############################################\r\n"
				+ "####################################################################################################\r\n"
				+ "##												  ##\r\n"
				+ "##  Το πρόγραμμα αυτό αναπτύχθηκε ως γέφυρα μεταξύ Pylon και ERP. Διαβάζει ένα .txt αρχείο που    ##\r\n"
				+ "##  εξάγεται από το Pylon και βάσει αυτού δημιουργεί ένα άλλο .txt αρχείο το οποίο εισάγεται      ##\r\n"
				+ "##  στο ERP.											  ##\r\n"
				+ "##												  ##\r\n"
				+ "####################################################################################################\r\n"
				+ "####################################################################################################\r\n"
				+ "####################################################################################################\r\n"
				+ "\r\n"
				+ "\r\n"
				+ "====================================================================================================\r\n"
				+ "\r\n"
				+ "\r\n"
				+ "####################################################################################################\r\n"
				+ "########################################     Ενότητες    ###########################################\r\n"
				+ "####################################################################################################\r\n"
				+ "##												  ##\r\n"
				+ "##					1) Αρχείο Pylon						  ##\r\n"
				+ "##					2) Εύρεση αρχείου Pylon 				  ##\r\n"
				+ "##					3) Εισαγωγή ημερομηνίας					  ##\r\n"
				+ "##					4) Επιλογή Λογιστικού ’ρθρου				  ##\r\n"
				+ "##					5) Πλήκτρο \"Εκκίνηση\" 					  ##\r\n"
				+ "##					6) Μηνύματα κονσόλας 					  ##\r\n"
				+ "##					7) Διάβασμα αρχείου Pylon				  ##\r\n"
				+ "##					8) Διόρθωση Κωδικών Λογαριασμών				  ##\r\n"
				+ "##					9) Το αρχείο PR.txt					  ##\r\n"
				+ "##					10)\r\n"
				+ "\r\n"
				+ "\r\n"
				+ "====================================================================================================\r\n"
				+ "\r\n"
				+ "\r\n"
				+ "####################################################################################################\r\n"
				+ "########################################   Περιεχόμενα   ###########################################\r\n"
				+ "####################################################################################################\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					1) Αρχείο Pylon						  ##\r\n"
				+ "##												  ##\r\n"
				+ "##      Πρώτα πρέπει να γίνει εξαγωγή ενός αρχείου .txt από το πρόγραμμα Pylon. Το όνομα του      ##\r\n"
				+ "##      αρχείου δεν παίζει ρόλο, αλλά η κωδικοποίηση πρέπει να είναι UTF-16 LE (αυτή είναι η 	  ##\r\n"
				+ "##      προεπιλεγμένη).										  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					2) Εύρεση αρχείου Pylon 				  ##\r\n"
				+ "##												  ##\r\n"
				+ "##      Ο χρήστης τρέχει το πρόγραμμα. Πρέπει να εισάγει στο πεδίο \"Αρχείο ’ρθρου\" την διαδρο-    ## \r\n"
				+ "##      μή του αρχείου που έκανε εξαγωγή απ' το Pylon. Υπάρχει η δυνατότητα να πληκτρολογήσει     ##\r\n"
				+ "##      στο πεδίο αυτό, αλλά δεν ενδείκνυται. Μπορεί αντίθετα να πιέσει το πλήκτρο \"...\" το       ##\r\n"
				+ "##      οποίο ανοίξει ένα παράθυρο αναζήτησης στον εξερευνητή αρχείων του συστήματος. Το παρά-    ##\r\n"
				+ "## 	θυρο αναζήτησης είναι σχεδιασμένο ώστε να ξεκινάει να ψάχνει από την Επιφάνεια Εργασί-    ##\r\n"
				+ "##      ας του συστήματος και βλέπει μόνο .txt αρχεία και φακέλους ως προεπιλογή. Αφού ο χρή-     ##\r\n"
				+ "##  	στης εντοπίσει το αρχείο στο παράθυρο αναζήτησης μπορεί να πατήσει διπλό κλίκ σε αυτό     ##\r\n"
				+ "##  	ή να το επιλέξει και να πιέσει Open (’νοιγμα). Οι δύο αυτές κινήσεις έχουν το ίδιο α-  	  ##\r\n"
				+ "##  	ποτέλεσμα (εμφάνιση διαδρομής αρχείου στο πεδίο \"Αρχείο ’ρθρου\"). Η διαδρομή αυτή εί-	  ##\r\n"
				+ "## 	ναι εκείνη η οποία χρησιμοποιεί το πρόγραμμα για να διαβάσει το αρχείο .txt του Pylon.    ##\r\n"
				+ "##												  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##					3) Εισαγωγή ημερομηνίας					  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##      Η ημερομηνία που εισάγει ο χρήστης πρέπει να είναι πολύ συστηματική. Πρέπει πάντα να      ##\r\n"
				+ "##  	είναι της μορφής μέρα-διαχωριστικό-μήνας-διαχωριστικό-χρόνος. Η μέρα, ο μήνας και ο  	  ##\r\n"
				+ "## 	χρόνος πρέπει να είναι δύο ψηφία και το διαχωριστικό να είναι ένας χαρακτήρας (δεν έ-  	  ##\r\n"
				+ "## 	χει σημασία τί χαρακτήρας, αρκεί τα διαχωριστικά να είναι ο ίδιος χαρακτήρας). Κάποια 	  ##\r\n"
				+ "## 	παραδείγματα σωστής ημερομηνίας είναι : 01/01/21  30-11-20  29=02=20  19+12+96		  ##\r\n"
				+ "## 	Η ημερομηνία επίσης πρέπει πάντα να είναι αυστηρά 8 χαρακτήρες. Το πρόγραμμα δεν επι-	  ##\r\n"
				+ "## 	τρέπει πάνω απο 8 χαρακτήρες στο πεδίο \"Ημ/νία\". Εαν ο χρήστης εισάγει μια ημερομηνία	  ##\r\n"
				+ "## 	πρέπει να σβήσει χαρακτήρες απο το πεδίο προκειμένου να γράψει άλλους (δεν μπορεί δη- 	  ##\r\n"
				+ "## 	λαδή να επιλέξει τα ψηφία της ημέρας πχ και να γράψει άλλη ημέρα, αλλά πρέπει πρώτα    	  ##\r\n"
				+ "## 	να σβήσει υπάρχοντα ψηφία για να συμπληρώσει άλλα. Αυτό δυστυχώς είναι αναγκάιο, αλλά 	  ##\r\n"
				+ "## 	είναι για καλό). Τέλος το πρόγραμμα ελέγχει εάν ο χρήστης έχει εισάγει υπάρχουσα ημε-	  ##\r\n"
				+ "## 	ρομηνία (πχ η ημερομηνία 30/02/20 δεν υπάρχει). Εαν ο χρήστης έχει εισάγει λανθασμένη 	  ##\r\n"
				+ "## 	ημερομηνία το πρόγραμμα εμφανίζει σχετικό μήνυμα στην κονσόλα και ΔΕΝ προχωράει σε κά- 	  ##\r\n"
				+ "## 	ποια ενέργεια όσον αφορά το δίαβασμα του αρχείου .txt από το Pylon.			  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					4) Επιλογή Λογιστικού ’ρθρου				  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##	Ο χρήστης πρέπει να επιλέξει ένα από τα διαθέσιμα άρθρα. Εξ' ορισμού είναι επιλεγμένο	  ##\r\n"
				+ "## 	το άρθρο \"ΜΙΣΘΟΔΟΣΙΑ\". Η επιλογή του άρθρου περιορίζει την ημερομηνία που πρέπει να 	  ##\r\n"
				+ "## 	εισάγει ο χρήστης. Η μισθοδοσία είναι πάντα την τελευταία του μήνα, το επίδομα αδείας 	  ##\r\n"
				+ "## 	είναι πάντα την προτελευταία και η αποζημίωση αδείας την προ-προτελευταία. Σε οποιαδή-	  ##\r\n"
				+ "## 	ποτε περίπτωση το πρόγραμμα εμφανίζει σχετικό μήνυμα στην κονσόλα.			  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					5) Πλήκτρο \"Εκκίνηση\" 					  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##	Όταν ο χρήστης πιέζει το πλήκτρο \"Εκκίνηση\" το πρόγραμμα διαβάζει τα δεδομένα που έχει    ##\r\n"
				+ "##   	εισάγει ο χρήστης και εφόσον είναι έγκυρα, ξεκινάει να διαβάζει από το αρχείο .txt που	  ##\r\n"
				+ "## 	έχει επιλέξει στο πεδίο \"Αρχείο ’ρθρου\". Αφού πιέσει ο χρήστης το πλήκτρο και πριν δια-   ##\r\n"
				+ "## 	βαστεί το αρχείο πραγματοποιούνται κάποιοι έλεγχοι και μόνο αν το αρχείο περάσει τους 	  ##\r\n"
				+ "## 	ελέγχους αυτούς το πρόγραμμα το διαβάζει. Εαν δεν περάσει από κάποιο έλεγχο το πρόγραμ-   ##\r\n"
				+ "##	μα εμφανίζει σχετικά μηνύματα στην κονσόλα και δεν διαβάζει κάτι από το Pylon αρχείο      ##\r\n"
				+ "##	ούτε γράφει κάτι στο .txt αρχείο που δημιουργεί.					  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					6) Μηνύματα κονσόλας 					  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##	Η κονσόλα εμφανίζει πάντα σχετικά μηνύματα εαν το πρόγραμμα βρει κάποιο σφάλμα κατά την   ##\r\n"
				+ "##	εκτέλεση. Στην κονσόλα επίσης εμφανίζονται κάποια μηνύματα όπως τα περιεχόμενα του αρ-	  ##\r\n"
				+ "##	χείου που διαβάζεται ή ποιοι κωδικοί λογαριασμού αλλάζουν σε ποιούς. Σε οποιαδήποτε πε-	  ##\r\n"
				+ "##	ρίπτωση εαν συμβεί κάποιο \"σημαντικό\" γεγονός κατά την εκτέλεση του προγράμματος εμφα-	  ##\r\n"
				+ "##	νίζεται σχετικό μήνυμα στην κονσόλα. Εαν στην κονσόλα εμφανιστέι το μήνυμα \"Σφάλμα:\"	  ## \r\n"
				+ "##	και μετά την περιγραφή του σφάλματος δεν κάνει καμία ενέργεια γραψίματος στο αρχείο	  ##\r\n"
				+ "##	PR.txt											  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					7) Διάβασμα αρχείου Pylon				  ##\r\n"
				+ "## 												  ##\r\n"
				+ "##	Κατά την ανάγνωση του αρχείου Pylon διαβάζονται μόνο οι 35 τελευταίοι χαρακτήρες κάθε	  ##\r\n"
				+ "##	γραμμής. Εκεί βρίσκονται όλες οι πληροφορίες που χρειάζονται για την καταχώρηση στο 	  ##\r\n"
				+ "##	ERP. Η πρώτη γραμμή κάθε αρχείου αγνοείται γιατί περιέχει κεφαλίδες και η τελευταία 	  ##\r\n"
				+ "##	χρησιμοποιείται μόνο για να συγκριθεί το ποσό της χρέωσης με αυτό της πίστωσης (πρέ-	  ##\r\n"
				+ "##	πει υποχρεωτικά να είναι ίσα).								  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					8) Διόρθωση Κωδικών Λογαριασμών				  ##\r\n"
				+ "##												  ##\r\n"
				+ "##	Εξαγωγή του αρχείου Pylon δεν έχει τους κωδικούς λογαριασμών στην μορφή που πρέπει να	  ##\r\n"
				+ "##	καταχωρηθούν στο ERP. Οι αλλαγές κωδικών που γίνονται πάντα εμφανίζονται στην κονσόλα.	  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				+ "##					9) Το αρχείο PR.txt					  ##\r\n"
				+ "##												  ##\r\n"
				+ "##	Αφού γίνει η διόρθωση των κωδικών λογιστικής, τα δεδομένα που έχουν διαβαστεί απο το 	  ##\r\n"
				+ "##	πρόγραμμα είναι ελεγμένα και πλέον μπορούν να εισαχθούν στο PR.txt. Αν το αρχείο αυτό	  ##\r\n"
				+ "##	δεν υπάρχει, το δημιουργεί το πρόγραμμα. Αν υπάρχει ήδη, το πρόγραμμα προσαρτεί τα δεδο-  ##\r\n"
				+ "##	μένα κάτω από τα ήδη υπάρχοντα στο αρχείο χωρίς να τα διαγράψει. Αφού γίνει επιτυχώς η	  ##\r\n"
				+ "##	ενημέρωση του αρχείου, τότε εμφανίζεται στην κονσόλα η διαδρομή του. (το αρχείο PR.txt	  ##\r\n"
				+ "##	δημιουργείται στον κατάλογο από τον οποίο διαβάστηκε το αρχείο Pylon. Καλό είναι τα 	  ##\r\n"
				+ "##	αρχεία Pylon που εξάγονται να βρίσκονται σε ένα κατάλογο πχ Desktop ώστε να υπάρχει 	  ##\r\n"
				+ "##	ένα μόνο αρχείο PR.txt)									  ##\r\n"
				+ "##												  ##\r\n"
				+ "##												  ##\r\n"
				);
		
	}

}
